about.html
---
layout: page
title: About
excerpt: Brief description of Volts, Sheaves, and Trees
---

<p>
I'm currently a master's student in statistics, with a background in, well, a lot of stuff.
Here's a list of the research projects and graduate courses I participated in as an undergrad.
</p>

<ul class="org-ul">
<li>Research projects (mainly numerical simulations on supercomputers)
<ul class="org-ul">
<li>Quantum optics (resonances in molecules coupled to plasmonic materials)</li>
<li>Hypersonic shock wave fluid dynamics</li>
<li>Microfluidic magnetohydrodynamics</li>
</ul></li>
<li>Graduate courses
<ul class="org-ul">
<li>Differential geometry</li>
<li>Riemannian geometry</li>
<li>Algebraic topology</li>
<li>Geometric control theory</li>
<li>Abstract algebra</li>
</ul></li>
</ul>

<p>
Now I've moved into statistics and machine learning, where I'm focusing on Bayesian and information theoretic methods, as well as stuff I can't talk about, because some of it's unpublished and I'm using it for an automated trading system.
Given my background, it's probably not surprising that I'd like to learn more about topological data analysis and information geometry, but those are on the back burner for now. 
</p>

<p>
This summer, I'll be participating in the Google Summer of Code, implementing a new form of GPU-friendly reverse-mode automatic differentiation in Haskell, via the <code>accelerate</code> library.
The method should provide an asymptotic speedup for a large class of functions of interest in applied settings.
</p>

<p>
I picked the name of this site for two reasons.
One, I like physics, geometry, and algebra.
Two, the acronym VST is also an acronym for Virtual Studio Technology (a popular plugin standard in digital audio), since I enjoy puttering around with electronic music.
</p>

<p>
Anyways, you can expect to see a mixture of topics written about here.
Beyond the stuff mentioned so far, you'll also see functional programming, mainly in Haskell and ATS.
</p>
